Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase
Plugin property pane feature base for showing plugin properties in property pane.
using System.Collections.Generic;
using Tekla.Structures.Plugins.PropertyPaneFeature;
public class ExamplePluginPanelFeature : PluginPropertyPaneFeatureBase
{
public ExamplePluginPanelFeature()
{
this.InitializeFeature("TeklaWPFExamplePlugin", "TeklaWPFExamplePlugin", string.Empty);
this.BuildTemplate();
}
private void BuildTemplate()
{
// Add properties group
this.AddPropertyGroup("Properties", "Generic properties", true);
// Add properties for proprerties group
this.AddDualProperty("Properties", Dual.Numbering, "prefix", "startno", "albl_Numbering", "albl_Numbering");
this.AddCatalogProperty("Properties", Catalog.Profile, "profile", "", "", "Profile", "Profile");
this.AddSingleProperty("Properties", Single.String, "name", "Name", "Name");
this.AddSingleProperty("Properties", Single.Distance, "offset", "Offset Z", "Offset Z");
var values = new List<string>() { "Yes", "No", "Maybe" };
this.AddDropDownProperty("Properties", values, "possiblity", "Possibility", "Possibility");
// Add bolts group and properties
this.AddPropertyGroup("Bolts", "Bolt groups", false);
this.AddCatalogProperty("Bolts", Catalog.Bolt, "grade", "size", "", "Bolt", "Bolt");
this.AddCatalogProperty("Bolts", Catalog.Bolt, "grade2", "size2", "", "Bolt2", "Bolt2");
// Add rebars group and properties
this.AddPropertyGroup("Rebars", "Reinforcement", false);
this.AddCatalogProperty("Rebars", Catalog.RebarGrade, "rebargrade", "rebarsize", "bendradius", "Rebar", "Rebar");
this.AddCatalogProperty("Rebars", Catalog.RebarGrade, "rebargrade2", "rebarsize2", "bendradius2", "Rebar2", "Rebar2");
}
}

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.plugin
The plugin.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.propertyTemplate
The property pane template.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.boltCatalog
The bolt catalog.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.helpTopic
The help topic string.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.templateKey
The template key.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.propertyGroups
The property pane template.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.localization
The localization.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.localizationFile
The localization file name to load for the instance for the property pane.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.createComponentButton
The boolean value for creating open component dialog button to the property pane.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.appliedAttributes
The boolean value for creating open component dialog button to the property pane.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.events
The event handlers.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.isLocalized
The boolean value for indicating if the property pane is already localized.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.#ctor
Initializes a new instance of the Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase class.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.PropertyRepository
The property repository.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.Localization
The localization instance for the property pane. Each property pane has its own localization instance.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.Initialize


Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.Running(System.String[])


Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.Stopping(System.ComponentModel.CancelEventArgs)


Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.InitializeFeature(System.String,System.String,System.String,Tekla.Structures.Plugins.PropertyPane.PropertyPaneType,System.String,System.Boolean)
Initializes needed properties of an instance of the Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase class.
name: The name of the plugin.
title: The title of the UI.
helpTopic: The help topic string.
type: The plugin type  Tekla.Structures.Plugins.PropertyPane.PropertyPaneType, default value is PropertyPaneType.Plugin.
localizationFile: The name of localization file.
createComponentButton: The boolean value for creating a component dialog button to the property pane.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.ClearPropertyPaneTemplate
Clears a template for the instance of the Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase class.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.UpdatePropertyPaneTemplate
Updates a template for the instance of the Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase class.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.AddPropertyGroup(System.String,System.String,System.Boolean)
Creates a property group to template.
name: The name of the group.
label: The label of the group.
isExpanded: The default expansion of the group, default = true.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.AddSingleProperty(System.String,Tekla.Structures.Plugins.PropertyPane.Single,System.String,System.String,System.String)
Create single property based on type.
group: The property group name.
type: The type of the property.
name: The name of the property.
label: The label of the property.
tooltip: The label of the property.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.AddCatalogProperty(System.String,Tekla.Structures.Plugins.PropertyPane.Catalog,System.String,System.String,System.String,System.String,System.String)
Create catalog properties based on type.
group: The property group name.
type: The type of the property.
name: The name of the property.
size: The size property used in bolt and rebar grade type.
radius: The radius property used rebar grade type.
label: The label of the property.
tooltip: The label of the property.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.AddWeldProperty(System.String,Tekla.Structures.Plugins.PropertyPane.WeldEnum,System.String,System.String,System.String,System.String)
Create weld properties based on type.
group: The property group name.
type: The type of the property.
leftName: The name of the possible left side property.
rightName: The name of the possible right side property.
label: The label of the property.
tooltip: The label of the property.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.AddDualProperty(System.String,Tekla.Structures.Plugins.PropertyPane.Dual,System.String,System.String,System.String,System.String)
Create dual properties based on type
group: The property group name.
type: The type of the property.
firstPropertyName: The name of the first property.
secondPropertyName: The name of the second property.
label: The label of the property.
tooltip: The label of the property.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.AddDropDownProperty(System.String,System.Collections.Generic.IEnumerable{System.String},System.String,System.String,System.String)
Create drop down property based on given values. Selected value is stored as integer.
group: The property group name.
values: The visible values of the property.
name: The name of the property.
label: The label of the property.
tooltip: The label of the property.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.OnModuleManagerUpdate
Event handler to update translations and applied attributes.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.LoadLocalization
Loads a localization files for instance.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.UpdatePropertyTranslations
Updates property translations for instance.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.BuildPropertyPaneTemplate
Builds a template for the instance of the Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase class.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.RegisterPropertyPaneTemplate
Registers a template for the instance of the Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase class.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.AddPropertyToGroup(System.String,CommonObjects.PropertyBase)
Adds property to property group
group: Property group name
property: The property
Returns: The CommonObjects.PropertyTemplate.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.AddSinglePropertyToAppliedAttributes(Tekla.Structures.Plugins.PropertyPane.Single,System.String)
Adds property to applied attributes.
type: The property type.
name: The property name.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.AddCatalogPropertyToAppliedAttributes(System.String,System.String,System.String)
Adds property to applied attributes.
name: The property for name.
size: The property for size.
radius: The property for radius.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.AddWeldPropertyToAppliedAttributes(Tekla.Structures.Plugins.PropertyPane.WeldEnum,System.String,System.String)
Adds property to applied attributes.
type: The property type.
leftName: The property for left side name.
rightName: The property for right side name.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.AddDualPropertyToAppliedAttributes(Tekla.Structures.Plugins.PropertyPane.Dual,System.String,System.String)
Adds property to applied attributes.
type: The property type.
firstPropertyName: The first property name.
secondPropertyName: The second property name.

Tekla.Structures.Plugins.PropertyPane.PluginPropertyPaneFeatureBase.ValidateProfile(CommonObjects.PropertyBase)
Validates profile.
property: The property.
Returns: The validation result.